[
  {
    "id": 1,
    "name": "Macy Kuang",
    "title": "Founder",
    "company": "Miaomiao Games",
    "country": "Canada",
    "photoUrl": "../../images/people/macy_kuang.jpg",
    "bio": "Macy is the founder of Miaomiao Games, GDE for Wearables, host at Code to Create and organizer for AndroidTO conference. She is passionate about gaming and IOT.",
    "tags": [
      "Google Cardboard"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Wear / GlassGoogle Developer Expert",
        "link": "https://developers.google.com/experts/people/macy-kuang"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+MacyKuang"
      },
      {
        "name": "Website",
        "link": "http://macykuang.com/"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/macykuang"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/MacyKuang"
      }
    ]
  },
  {
    "id": 2,
    "name": "Graham Polley",
    "title": "Senior Software Engineer",
    "company": "Shine Technologies",
    "country": "Australia",
    "photoUrl": "../../images/people/graham_polley.jpg",
    "bio": "Graham is a senior software engineer based out of Melbourne Australia. He's passionate about promoting the adoption of cloud technologies into software development, and regularly blogs and gives presentations. Graham has extensive experience in building big data solutions for clients using the Google technology stack, and in particular with BigQuery & Dataflow. Graham works very closely with the GCP engineering team in the US, where he is a member of their cloud platform trusted tester program, and the solutions he helps build are used as internal exemplars of developer use cases. Graham is also a GDE on the GCP.",
    "tags": [
      "Google Cloud Platform"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+GrahamPolley"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/polleyg"
      }
    ]
  },
  {
    "id": 3,
    "name": "Pablo Caif",
    "title": "Software engineer",
    "company": "Shine Technologies",
    "country": "Australia",
    "photoUrl": "../../images/people/pablo_caif.jpg",
    "bio": "Pablo is a passionate software engineer who enjoys solving complex problems, and devising simple solutions. He works at Shine Technologies and he is part of a team that uses BigQuery and Dataflow to solve challenging and complex data processing business requirements. Pablo considers that scalability and performance are paramount to developing a great solution, and that is why he has been using Dataflow and BigQuery to bring these solutions to reality.",
    "tags": [
      "Google Cloud Platform"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+PabloCaif"
      }
    ]
  },
  {
    "id": 4,
    "name": "Konrad Dzwinel",
    "title": "Senior Front-End Developer",
    "company": "Brainly",
    "country": "Poland",
    "photoUrl": "../../images/people/konrad_dzwinel.jpg",
    "bio": "Konrad is a front-end developer at Brainly, Google Developer Expert for Web Technologies and co-organizer of Google Developers Group in Krakow, Poland. Over the years he worked for various startups, consultancies and software houses building websites, hybrid apps and internal tools. After work, he develops Chrome extensions, experiments with various front-end technologies, gives presentations and runs workshops.",
    "tags": [
      "Chrome"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Chrome Google Developer Expert",
        "link": "https://developers.google.com/experts/people/konrad-dzwinel"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+KonradDzwinel"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/kdzwinel"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/kdzwinel/"
      }
    ]
  },
  {
    "id": 5,
    "name": "Jana Moudrá",
    "title": "Co-Founder",
    "company": "Juicymo",
    "country": "Czech Republic",
    "photoUrl": "../../images/people/jana_moudra.jpg",
    "bio": "GDE (Google Developer Expert) for Dart. Jana is a passionate developer and modern web and mobile technology evangelist. She is an event organiser for GDG Prague, where she arranges events for developers including public lectures, code labs and hackathons – covering a wide range of subjects including technologies Dart or Android. She loves to help other developers and spread the knowledge about these technologies. <br/><br/>Jana co-founded a company called Juicymo, where she works on juicy apps and products and teaches at Unicorn College.",
    "tags": [
      "Chrome"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Dart Google Developer Expert",
        "link": "https://developers.google.com/experts/people/jana-moudr"
      },
      {
        "name": "GDG",
        "description": "Google Developers Group Prague",
        "link": "https://developers.google.com/groups/chapter/111919016509847766513/"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+JanaMoudrá"
      },
      {
        "name": "LinkedIn",
        "link": "https://cz.linkedin.com/in/janamoudra"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/Janamou"
      },
      {
        "name": "Blog",
        "link": "http://www.moudra.net/"
      }
    ]
  },
  {
    "id": 6,
    "name": "Doris Chen",
    "title": "Senior Technology Evangelist",
    "company": "Microsoft",
    "country": "USA",
    "photoUrl": "../../images/people/doris_chen.jpg",
    "bio": "Dr. Doris Chen is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java). Doris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, and trainings worldwide. She speaks at numerous international conferences and user groups including O’Reilly OSCON, Fluent, Dev Nexus, HTML5 Dev Conference, WebVisions,  JavaOne, SD Forum, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems. Doris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics.",
    "tags": [
      "Chrome"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+DorisChenTung"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/doristchen"
      },
      {
        "name": "Blog",
        "link": "http://blogs.msdn.com/b/dorischen/"
      }
    ]
  },
  {
    "id": 7,
    "name": "Jenny Tong",
    "title": "Developer Advocate",
    "company": "Google",
    "country": "USA",
    "photoUrl": "../../images/people/jenny_tong.jpg",
    "bio": "Jenny is a Developer Advocate on Cloud at Google. In this role she helps developers build cool stuff on all sorts of platforms. Previously she worked in a wide variety of software roles from robotics at NASA, to developer advocacy for Google Glass. She is passionate about education, especially on the subjects of technology and science. If she's away from her laptop, she's probably skating around a roller derby track, or hanging from aerial silk.",
    "tags": [
      "Android",
      "Firebase"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+mimming"
      }
    ]
  },
  {
    "id": 8,
    "name": "John Feig",
    "title": "Software Engineer",
    "company": "TiKL, Inc",
    "country": "USA",
    "photoUrl": "../../images/people/john_feig.jpg",
    "bio": "Google Developer Expert for Wearables (Google Glass and Android Wear) and Software Engineer at TiKL, Inc. I get to do lots of fun stuff at TiKL, like writing clients for new platforms from scratch, and touching the full stack. I have worked on the Android client, the Java servers, a web client, a bit of PhotoShop, as well as keeping up with TiKL's social media presence. My goal as a GDE is to help people write solid code, and help them to really wrap their heads around the platform.",
    "tags": [
      "Android"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Wear / Glass Google Developer Expert",
        "link": "https://developers.google.com/experts/people/e-john-feig"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+EJohnFeig"
      },
      {
        "name": "Website",
        "link": "http://ejf.io"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/ejohnfeig"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/emil10001"
      }
    ]
  },
  {
    "id": 9,
    "name": "Martin Omander",
    "title": "Program Manager for Google Developer Relations",
    "company": "Google",
    "country": "USA",
    "photoUrl": "../../images/people/martin_omander.jpg",
    "bio": "",
    "tags": [
      "Community"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+MartinOmander"
      }
    ]
  },
  {
    "id": 10,
    "name": "Justin Ribeiro",
    "title": "Software Engineer",
    "company": "Stickman Ventures Inc",
    "country": "USA",
    "photoUrl": "../../images/people/justin_ribeiro.jpg",
    "bio": "For the last 18 years, Justin has worked on enterprise and consumer-based software products – and is no stranger to building and deploying large-scale architecture for users in the field. As an early Google Glass Explorer, he has also worked extensively on integrating existing services with the platform – from real-time warehouse tracking to in-the-field sensor tracking for use in water management within agricultural operations. When Justin isn't building for Glass and Wear, he can be found building for Android and the web. Justin has successfully helped many startups bring concepts and ideas to market, and developed new internal systems to help even established companies become more efficient. Right now, Justin works at Stickman Ventures, managing software development teams on the US West Coast and overseas. He is also a co-organiser at GDG Oakdale, where he teaches and speaks on a wide range of Google technologies. He also spends time wiring and coding the Oakdale OpenMesh – a community-driven open wifi network. He lives in Oakdale with his wife, three daughters, and darkroom stockpile of HC-110.",
    "tags": [
      "Beacons / Physical Web"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Wear / GlassGoogle Developer Expert",
        "link": "https://developers.google.com/experts/people/justin-ribeiro"
      },
      {
        "name": "GDG",
        "description": "Google Developers Group Oakdale",
        "link": "https://developers.google.com/groups/chapter/117677091518865462359/"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+JustinRibeiro"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/justinribeiro"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/justinribeiro"
      },
      {
        "name": "Web",
        "link": "https://www.justinribeiro.com/"
      }
    ]
  },
  {
    "id": 11,
    "name": "Etienne Caron",
    "title": "Senior Mobile Developer / Android Lead",
    "company": "Intel Security",
    "country": "USA",
    "photoUrl": "../../images/people/etienne_caron.jpg",
    "bio": "Etienne has been an active member of the Android developer community in Montreal since 2010, and regularly devotes his time towards mentoring startups, developers and students in the mobile space. As part of the Montreal Android GDG, he organises meetups, hackathons, and gives regular talks on Android-related subjects. He's now part of the Google Developer Expert program.",
    "tags": [
      "Google Cardboard",
      "Android"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Developer Expert",
        "link": "https://developers.google.com/experts/people/justin-ribeiro"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+EtienneCaron"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/pub/etienne-caron/14/a65/5"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/kanawish"
      },
      {
        "name": "Web",
        "link": "http://gde.ninja/"
      }
    ]
  },
  {
    "id": 12,
    "name": "JeanCarl Bisson",
    "title": "Technical Evangelist",
    "company": "IBM",
    "country": "USA",
    "photoUrl": "../../images/people/jeancarl_bisson.jpg",
    "bio": "JeanCarl Bisson is a Technical Evangelist for IBM Bluemix. He has participated in over 100 hackathon over the last six years, winning prizes and cash. He has taken several hacks to market. He loves to quickly build prototypes and see how they work out.",
    "tags": [
      "Chrome",
      "JavaScript"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+JeanCarlBisson"
      }
    ]
  },
  {
    "id": 13,
    "name": "Gerard Sans",
    "title": "Software Developer",
    "company": "Independent",
    "country": "UK",
    "photoUrl": "../../images/people/gerard_sans.jpg",
    "bio": "Gerard is a multi-talented Computer Science Engineer specialised in Web. He is now an AngularJS fanboy and a community activist fighting for the JavaScript revolution. He has lived and worked for all sorts of companies in Germany, Brazil, UK and Spain. He is always up for a good challenge. He enjoys running AngularJS Labs London, mentoring AngularJS students, participating in the community, giving talks and writing technical articles at Medium.",
    "tags": [
      "Chrome",
      "JavaScript"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Web Technologies Developer Expert",
        "link": "https://developers.google.com/experts/people/gerard-sans?hl=es-419"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+GerardSans"
      }
    ]
  },
  {
    "id": 14,
    "name": "Matias Molinas",
    "title": "Software Developer",
    "company": "JustMotion LLC",
    "country": "ARG",
    "photoUrl": "../../images/people/matias_molinas.jpg",
    "bio": "Matias is an experienced software architect, designer, and developer. He has worked on multiple projects, including consumer, enterprise, and medical software products and applications.<br>He's currently working as a Java Architect on an eCommerce platform for Project ARA. The project will enable users to create a modular smartphone that's precisely tailored to their functional and aesthetic preferences. Since 2011, Matias has been a Google Developer Expert for YouTube APIs.<br>As an independent entrepreneur, Matias is also currently involved in a new platform for mobile application and wearable technology – and has previously run a startup venture related to smart video and social content recommendation engine, and in an ads optimisation tool. He was a consultant for the University of Nebraska too – for a project in computer aided surgery, addressing design, 3D-tracking, and 3D-visualization aspects.<br>At college, Matias studied Biomedical Engineering at the UNER in Argentina – where he lives with his wife and two children. When time allows, he enjoys playing water polo.",
    "tags": [
      "Android Wear",
      "Android",
      "Google Fit"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Developer Expert",
        "link": "https://developers.google.com/experts/people/matias-molinas"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+MatiasMolinas"
      }
    ]
  },
  {
    "id": 15,
    "name": "Damodar Periwal",
    "title": "Software Engineer, Founder",
    "company": "Software Tree",
    "country": "USA",
    "photoUrl": "../../images/people/damodar_periwal.jpg",
    "bio": "Damodar Periwal has an extensive background in databases, transaction processing, as well as distributed and object-oriented technologies. Damodar has more than 25 years of industry experience, having worked at leading companies like Google, TIBCO, Borland, Ashton-Tate, and Tandem Computers. Damodar has an MS (Computer Science) degree from University of Wisconsin (Madison) and an undergraduate engineering degree from Birla Institute of Technology and Science, Pilani (India).",
    "tags": [
      "Android",
      "Android Object Relational Mapping"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/107558643286241506852"
      }
    ]
  },
  {
    "id": 16,
    "name": "Murat Yener",
    "title": "Android Developer",
    "company": "Intel",
    "country": "TUR",
    "photoUrl": "../../images/people/murat_yener.png",
    "bio": "Murat Yener is a code geek, open source committer and working in Intel as an Android Developer. He has extensive experience on developing Java, Web, JavaEE and OSGi applications besides teaching courses and mentoring. Murat is an Eclipse committer and one of the initial committers of Eclipse Libra project. He is currently working on building native and Hybrid mobile apps with mGWT. <br>He is the author of upcoming Professional Java EE Design Patterns book from Wiley. He has been a user group leader at GDG Istanbul since 2009. Murat is a regular speaker at conferences like JavaOne, EclipseCon and user group meetings.",
    "tags": [
      "Android"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Developer Expert",
        "link": "https://developers.google.com/experts/people/matias-molinas"
      },
      {
        "name": "GDG",
        "description": "Google Developers Group Istanbul",
        "link": "https://developers.google.com/groups/chapter/100514812580249787371/"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+MuratYener"
      },
      {
        "name": "LinkedIn",
        "link": "www.linkedin.com/in/muratyener"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/yenerm"
      },
      {
        "name": "Blog",
        "link": "www.devchronicles.com"
      }
    ]
  },
  {
    "id": 17,
    "name": "Siamak Ashrafi",
    "title": "Researcher/Developer",
    "company": "Biotech Startup",
    "country": "USA",
    "photoUrl": "../../images/people/siamak_ashrafi.jpg",
    "bio": "Ash is a researcher TDI working on medical biomarkers (scientific publications) & CTO Zoewear building physiologically intelligent clothing (technology patents).  His frequent code-a-thon wins have gone on to become published Apps (iOS & Android).  As a thought leader in wearable/mobile development he is an enthusiastic teacher/speaker helping to promote the ecosystem (fashion & technology).  You can usually catch him DJ or competing in one of the phases of water. (Snowboarding [solid], Surfing [liquid] & Kiteboarding [vapor].",
    "tags": [
      "Android Wear"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+SiamakAshrafi"
      }
    ]
  },
  {
    "id": 18,
    "name": "Latha Krishnaswamy",
    "title": "Researcher/Developer",
    "company": "",
    "country": "",
    "photoUrl": "",
    "bio": "Software development expertise, entrepreneur enthusiast in new software development.",
    "tags": [
      "Google Cloud Platform"
    ]
  },
  {
    "id": 19,
    "name": "Lynn Langit",
    "title": "Independent Cloud and Big Data Architect",
    "company": "Lynn Langit Consulting",
    "country": "USA",
    "photoUrl": "../../images/people/lynn_langit.jpg",
    "bio": "Big Data and Cloud Architect - AWS Community Hero, Google Cloud Developer Expert, Microsoft MVP. Author of Lynda.com, Pluralsight, Wintellect and DevelopMentor courseware. YouTube BigData playlist. Over 250k people have watched my 'Hadoop Fundamentals' courses online.",
    "tags": [
      "Google Cloud Platform"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Google Cloud Developer Expert",
        "link": "https://developers.google.com/experts/people/lynn-langit"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/+LynnLangit"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/lynnlangit"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/lynnlangit"
      },
      {
        "name": "Web",
        "link": "http://lynnlangit.com/"
      }
    ]
  },
  {
    "id": 20,
    "name": "Todd McLeod",
    "title": "Faculty",
    "company": "Fresno City College",
    "country": "USA",
    "photoUrl": "../../images/people/todd_mcleod.jpg",
    "bio": "Todd McLeod is Faculty in Computer Science at California State University, Fresno. He is also faculty at Fresno City College.",
    "tags": [
      "Go"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/102058450286415797711"
      }
    ]
  },
  {
    "id": 21,
    "name": "Keven Wang",
    "title": "Senior Technical Staff",
    "company": "SalesforceIQ",
    "country": "USA",
    "photoUrl": "",
    "bio": "Keven Wang is a Senior Member of Technical Staff at SalesforceIQ, where he leads the Chrome extension project, building it from zero into the fastest-growing client at RelateIQ. On this journey, Keven architected Chrome extension to enable rapid deployment and code-sharing with RelateIQ's web-app client using AngularJS. Keven has delivered 10+ features in Chrome extension in 12 months, leveraging backend infrastructure on email / calendar sync (IMAP, Google Calendar API) and push notifications (Google Cloud Messaging). Keven joined RelateIQ in 2013, prior to its acquisition by Salesforce in 2014.",
    "tags": [
      "Chrome",
      "JavaScript"
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/u/0/109191163123171982574"
      }
    ]
  },
  {
    "id": 22,
    "name": "Valentyn Shybanov",
    "title": "Software Engineer",
    "company": "Twinfield",
    "country": "UKR",
    "photoUrl": "../../images/people/valentyn_shybanov.jpg",
    "bio": "Started software engineering career with low level system programming mostly on start of the era of modern computers, my interest involved from programming calculators and simple games to developing complex enterprise-level cloud-based solutions. Now, with help of modern technologies, solutions and concepts, I am not just trying to bring any, even most courageous ideas into life, but also spread the light of all brilliant technology solutions I can find to all other developers. Now focused on combination of Web technologies (AngularJS, Dart) and cloud platforms (Google Cloud Platform, Amazon EC2, Azure etc).<br> Currently I am Google Developer Expert (Cloud and Web) and Software Architect of Twinfield International N.V. and building online accounting system and responsible for making architectural decisions for bringing Twinfield application into cloud. Also part of Wolter’s Kluwer’s European PaaS initiative (building enterprise-level PaaS solution to unify development environment for different WK companies).",
    "tags": [
      "App Engine",
      "Chrome",
      "JavaScript",
      "Dart",
      "GoLang"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Google Cloud Platform Developer Expert",
        "link": "https://developers.google.com/experts/people/valentyn-shybanov"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+ValentynShybanov"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/olostan"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/in/olostan"
      }
    ]
  },
  {
    "id": 23,
    "name": "Mike Wolfson",
    "title": "Independent Android Developer",
    "company": "ClearToken",
    "country": "USA",
    "photoUrl": "../../images/people/mike_wolfson.png",
    "bio": "Mike is a senior-level Android\\Java developer with a proven history of success and a long list of accomplishments. He's also a great developer, an excellent communicator and leader, and has a comprehensive knowledge of the full life-cycle of mobile-focused development and design. Mike's a passionate coder too, with an eye for simplicity – and a love for writing beautiful, pragmatic, code.",
    "tags": [
      "Android"
    ],
    "badges": [
      {
        "name": "GDE",
        "description": "Android Developer Expert",
        "link": "https://developers.google.com/experts/people/mike-wolfson"
      }
    ],
    "socials": [
      {
        "name": "Google+",
        "link": "https://plus.google.com/+MichaelWolfson"
      },
      {
        "name": "Twitter",
        "link": "https://twitter.com/mikewolfson"
      },
      {
        "name": "LinkedIn",
        "link": "https://www.linkedin.com/profile/view?id=5033923"
      },
      {
        "name": "web",
        "link": "http://www.mikewolfson.com/"
      }
    ]
  },
  {
    "id": 24,
    "name": "Forbes Hedges",
    "title": "",
    "company": "Cloudata Inc",
    "country": "USA",
    "photoUrl": "",
    "bio": "Cloudata Czar and CloudBnB Marketplace Builder and Operator (www.hwswworld.com), has accumulated over 20 years of experience in automation, which is part of his passion instead of career. He started his career in the EDA industry working for two public companies on chip design automation before he started his own startup journey as a self-taught businessman by bootstrapping a few startups including Cloudata Inc.",
    "tags": [
      "Hyperscale Hyperconvergence"
    ]
  }
]