[{"id":12,"name":"Jana Moudrá","title":"Co-Founder","company":"Juicymo","country":"Prague, Czech Republic","bio":"GDE (Google Developer Expert) for Dart. Jana is a passionate developer and modern web and mobile technology evangelist. She is an event organiser for GDG Prague, where she arranges events for developers including public lectures, code labs and hackathons – covering a wide range of subjects including technologies Dart or Android. She loves to help other developers and spread the knowledge about these technologies. <br/><br/>Jana co-founded a company called Juicymo, where she works on juicy apps and products and teaches at Unicorn College."},{"id":11,"name":"Marie Schweiz","title":"","company":"Freelance UI / UX","country":"Munih, Germany","bio":"Marie was one of the first freelance designers for android, back in 2011. With her unique specialty she spoke at several conferences such as Mobile design Meetup Oslo, DevFest Istanbul, Campus London, UXcamp Europe, droidcon Italy, Webexpo Prague from 2011 until now. As senior mobile UX designer, her help influenced huge tech giants and startups to improve their mobile experience and relationship with their developers."},{"id":34,"name":"Baris Yesugey","title":"Region Lead, Google Developer Relations","company":"Google","country":"Istanbul","bio":"As an engineer who is in love with the coolest new technology, I thrive by connecting to other developers who share similar passions. My team is behind all the rich, technical content on developers.google.com<br/><br/>I act as an advocate for third party developers’ needs within Google and passionate evangelists for Google technologies in the outside world. I love connecting with other developers and partners; people who enjoy teaching, speaking or writing about cutting-edge technologies.<br/><br/>By working closely with third party developers who are building applications and businesses that showcase Google’s developer platforms, I grow and support the developer community, teaching and supporting developers around MENA region."},{"id":32,"name":"Esin IŞIK","title":"Independent Experience Designer","company":"Esin ISIK Experience Design","country":"Istanbul","bio":"Esin is an independent user experience designer with 5 years experience in fields including banking IT, user research in sensitive topics, emotional design, interaction design, service design, creative facilitation.<br/><br/>She completed a master's degree in TUDelft in the Netherlands in 2010 in the field of Design for Interaction after an undergarduate degree at the department of Industrial Design at METU (Middle East Technical University) in Ankara in 2007. She first started with digital experience design consulting in i-am Istanbul, then was in Denizbank and Garanti Bank's IT companies.<br/><br/>Her current focus is getting startup teams to become more experience design conscious and she also keeps being  a consultant for corporate design teams and IT projects."},{"id":8,"name":"Jonathan LeBlanc","title":"Head of Global Developer Advocacy","company":"Paypal","country":"France","bio":"Jonathan LeBlanc is an Emmy award winning software engineer, author of the O’Reilly book \"Programming Social Applications\", co-author of the upcoming title \"Identity and Data Security for Web Developers\", and the Head of Global Developer Advocacy for Braintree and PayPal.<br/><br/>Specializing in identity, auth and security, hardware to web interconnectivity, and data mining techniques, as well as open source initiatives around social engagement, Jonathan works on the development of emerging initiatives towards building a more user-centric web."},{"id":15,"name":"Buşra Deniz","title":"Mobile Software Developer","company":"GDG Istanbul","country":"Istanbul","bio":"Busra Deniz is a Software Engineer who has a keen interest in developing high-quality software by applying agile principles and methodologies, especially Scrum.<br/><br/>She is a Certificated Scrum Master and mobile engineer in Netas. Currently, working on an international project that provides iOS and Android SDKs those allow other programmers to develop their applications, which are capable of voice call, video call and IM using WebRTC.<br/><br/>Besides being co-organizer in two different community, Google Developer Group and WomenTechMakers İstanbul, she enjoys voluntarily organizing and speaking at developer events. Also, she believes in sharing knowledge and collaborating with the other people through these events, will come hand in hand with innovation and new perspectives. She always loves being part of a team and thinks that individual commitment to a team is the key to success. As a result of that she is a big fan of agile methodologies including Scrum, TDD and XP. Besides agile, she is also got excited almost every new technology in mobile platforms. And, as a software engineer, her goal is delivering software with high quality and robust architecture. In order to achieve that she highly relies on unit testing and mobile test automation."},{"id":17,"name":"Şahin Yalabık","title":"Game Designer","company":"Gram Games","country":"Istanbul","bio":"I'm a game designer, currently working at Gram Games since June 2015.<br/>My previous job experiences/titles were:<br/>-Game Designer / Producer at Peak Games (2011-2014)<br/>-Boardgame Designer / Founder at Oyun Mühendisi (2007-2011)<br/><br/>So far, I've worked at 3 f2p titles, each one installed on 1 million+  devices. I also have 2 published boardgame titles currently available in the market."},{"id":18,"name":"Murat Gürel","title":"Game Developer","company":"Gram Games","country":"Istanbul","bio":"Currently works at Gram Games as a Game Developer. He has been developing mobile apps and games professionally for 3 years. Previous works include native apps and cross-platform games with Unity. Graduated from University of Surrey, England with a degree in Electronics & Computer Engineering."},{"id":22,"name":"Geertjan Wielenga","title":"Product Manager","company":"NetBeans","country":"","bio":"Geertjan is a product manager working on JavaScript and Java in Oracle, together with tools provided by NetBeans IDE."},{"id":16,"name":"Mark Stephens","title":"","company":"IDRsolutions","country":"UK","bio":"Mark Stephens has been working with Java since 1997 and PDF since 1999. He is an Entrepreneur and software developer who setup IDRsolutions in 1999. IDRsolutions develops a Java PDF library and a PDF to HTML5/SVG converter. He has an MSC degree in Computer Science and an MA in Mediaeval History with a detailed knowledge of Byzantine and Ottoman History. So DevFest is his dream conference as it combines coding with castles, churches, mosques and cisterns."},{"id":29,"name":"Gökhan Yılmaz","title":"IT Specialist","company":"IBM","country":"Istanbul","bio":"Gökhan Yılmaz, Fırat Üniversitesinden mezun olduktan sonra IBM'de Bilişim Teknolojileri  Uzmanı  olarak Web Ara Katman Uygulamaları ekibinde görev almıştır. Gökhan, öğrencilik hayatında IBM Next-Generation Topluluğunda üniversite temsilcisi olarak görev almış ve birçok IBM Teknolojisi ile çalışma fırsatı bulmuştur. 2014 yılında IBM Yazılım Akademisi'ne katılarak Türkiye birincisi seçilmiş ve Prag'da düzenlenen IBM Best Student Recognition Event'e katılma hakkı kazanmıştır. Gökhan, ayrıca Bluemix ile ilgili Türkçe kaynaklar oluşturmakta ve bunları gokhanyilmaz.name adresinde okurları ile paylaşmaktadır."},{"id":30,"name":"Burak Çakıl","title":"Cloud Platform Solutions Consultant","company":"IBM","country":"Istanbul","bio":"Burak is a Cloud Technical Consultant  working in Ecosystem Development, IBM Turkey. He is specialized in IBM Bluemix, which is a Cloud PaaS platform. He has 9 years of IT experience. Previously, he worked as a Middleware Specialist for 5 years. He is experienced in Java EE application development, and middleware such as IBM WebSphere, Oracle Weblogic, Tomcat etc. He has a BSc degree from Computer Engineering, Yildiz Technical University, and he is continuing for his MSc degree from the same department."},{"id":13,"name":"Elif Boncuk","title":"Software Specialist","company":"Garanti Teknoloji","country":"Istanbul","bio":"Mobile Application Developer at Garanti Technology. Working on mobile technologies especially on Android (since Eclair) more than 4 years since the team formation in her current company. <br/>Tech Enthusiast, Blogger, Traveller, Photographer"},{"id":20,"name":"Xavier Hallade","title":"Application Engineer","company":"Intel","country":"France","bio":"Xavier is application engineer at Intel Software and Services Group, where he works on a wide range of Android frameworks, libraries and applications.<br/><br/>He's a Google Developer Expert in Android, with a focus on the Android NDK and Android TV."},{"id":1,"name":"Said Tahsin Dane","title":"Android Developer","company":"GDG Istanbul","country":"Istanbul","bio":"GDE (Google Developer Expert) for Android. Experience with Android (since Cupcake), Google Glass, Android Wear, and (even on!) iOS. Very passionate developer who tries to live on the bleeding edge of technology. Also very interested in mobile UX. <br/><br/>Active member and organizer at GDG Istanbul enjoying organizing various conferences and hackathons. Also a part of GDG[X] - a GDG related open-source organization."},{"id":2,"name":"Hasan Hosgel","title":"Senior Android Engineer","company":"Kitchen Stories","country":"Germany","bio":"Hasan Hoşgel is a dedicated Android developer with more then ten years of professional programming. Since 2010 also developing Android applications. Continuous improvement of the architecture and also quality are his interest. He is also co-organizer of the “GDG Berlin Android”. Now working for Kitchen Stories and before that more then seven years for ImmobilienScout24."},{"id":9,"name":"Orhan Obut","title":"Android Developer","company":"Blacklane","country":"Germany","bio":"Orhan Obut is android developer at Blacklane in Berlin. He is a big fan of open-source and constantly supports it. He has been worked on various projects from m-banking applications to m-commerce applications. He always aims to use the software principles, best practices and share the knowledge with the community."},{"id":14,"name":"Enrique López Mañas","title":"Mobile Developer","company":"Freelance","country":"Munich, Germany","bio":"Enrique is a Google Developer Expert, and Freelance Mobile Engineer in Munich.<br/><br/>He spends his free time developing OpenSource code, writing articles, learning languages or taking photographies. He loves books, nature, traveling, and talking about him in third person"},{"id":3,"name":"Çağatay Çivici","title":"Founder","company":"PrimeTek","country":"Turkey","bio":"Cagatay Civici is a member of JavaServer Faces Expert Group in JCP, the founder of popular PrimeFaces Project and PMC member of open source JSF implementation Apache MyFaces. He’s a recognized speaker in international conferences such as JavaOne and in many local JUG events around the world. Cagatay is also the co-author of \"Definitive MyFaces\" book and technical reviewer of various books on java web frameworks. He has over 10 years of experience in front end development with java."},{"id":4,"name":"Martin Liersch","title":"Android Developer","company":"Freelance","country":"Germany","bio":"He is an Android developer and works as a freelancer. Since he got his first phone running Android 2.0 he has developed a couple of dozen apps, of which some cracked the 1 million download mark. He is also a co-lead of GDG (Google Developer Group) Bodensee."},{"id":7,"name":"Pietro Alberto Rossi","title":"Android Developer","company":"Yaapo Mobile","country":"Italy","bio":"Programmer since 2000, starting with QBasic and most recently Android development and learning C, Assembler, C++, HTML, PHP and Java along the way.Working in a startup Mosaicoon S.P.A., my strength is Android programming and problem solving. I've been an invited speaker at Rome Codemotion 2013, Madrid Codemotion 2013, Google London such as candidate Google Developer Expert in Android and Droidcon Italy. I also been a speaker in other national events such as Linux, Day Linux Meeting, Java Day in Palermo and Ragusa."},{"id":23,"name":"Salim Kayabaşı","title":"Web Developer","company":"GDG Istanbul","country":"Istanbul","bio":""},{"id":5,"name":"Hüseyin Babal","title":"Full-Stack Software Engineer","company":"GittiGidiyor","country":"Istanbul","bio":"Tuts+ and Java Code Geeks author, PHP, JAVA, NodeJS developer. Docker performer, and Docker Meetup Co-organizer. Building highly scalable, realtime systems. Web Development mentor. NodeJS trainer. GDG conference speaker."},{"id":6,"name":"Barış Güler","title":"Software Development Team Leader","company":"Markafoni","country":"Turkey","bio":"I am the Front-end team leader in Markafoni using some of the latest technologies in web industry. Started the career as a back-end developer on the platform, J2EE and switched it into being an amateur Javascript developer. I call it like that since everyone need to see himself/herself as like it to improve abilities as well. Currently, working on design patterns and etc."},{"id":21,"name":"Ihor Dvoretskyi","title":"Operation Engineer","company":"Mirantis Inc.","country":"Ukraine","bio":"Ihor is an Operations Engineer at Mirantis Inc - the #1 Pure Play OpenStack Company, with a huge experience working in IT companies, where he was responsible for a couple of projects, tightly bound to Cloud computing and *nix systems. Ihor is deeply interested in OpenStack cloud platform, other Cloud technologies and Open Source projects. Also, Ihor is a big fan of Google and Google products.<br/><br/>Apart from work, Ihor is also interested in other branches of IT technology and starts diving into Robotics."},{"id":19,"name":"Resul Caner Yıldırım","title":"UX Designer","company":"GDG Istanbul","country":"Istanbul","bio":"Basically a technology geek. Focused on the marketing and design of mobile applications. Passionate about marketing, UX, IoT and Android. Since 2012, he has been writing technology news and articles on protechman.net<br/>Co-organiser of the Google Developer Group Istanbul & Chief Problem Solver of Mobil Istanbul. Speaks at conferences about marketing and UX. Also known as Protechman."},{"id":28,"name":"Burak Aydın","title":"","company":"GDG Ankara","country":"Ankara","bio":"Burak is one of the founder of 4pps mobile development company. He works as backend and android developer for two years. He also tries some hacks on quadcopters, arduino, raspberry pi and ble devices for create innovative products. Deep in curiosity, coffee lover, cycler."},{"id":24,"name":"Gülşah Köse","title":"","company":"Kripton","country":"Çanakkale","bio":"Çanakkale Onsekiz Mart Üniversitesi Bilgisayar Mühendisliği mezunuyum. Özgür yazılım geliştiricisi ve gönüllüsüyüm. LibreOffice pebble bileşeninin sorumlusuyum. pebble-remote (http://www.pebbleremote.com) projesinin yazarıyım."},{"id":25,"name":"Aybuke Ozdemir","title":"","company":"Çanakkale 18 Mart Üniversitesi","country":"Çanakkale","bio":"Çanakkale 18 Mart Üniversitesi son sınıf öğrencisiyim."},{"id":26,"name":"Kader Tarlan","title":"","company":"Çanakkale 18 Mart Üniversitesi","country":"Çanakkale","bio":""},{"id":27,"name":"Yeliz Taneroğlu","title":"","company":"Çanakkale 18 Mart Üniversitesi","country":"Çanakkale","bio":""},{"id":31,"name":"Filip  Maelbrancke","title":"Android Developer","company":"AppFoundry","country":"Belgium","bio":"Filip Maelbrancke is a software consultant at AppFoundry in Belgium. He mainly works on Android projects in the financial services, telecom and media sectors as a developer and tech lead."},{"id":33,"name":"Burcu Türkmen","title":"Android Developer","company":"GDG Eskişehir","country":"Eskişehir","bio":"She got bachelor degree from Anadolu University as a Computer Engineer in 2012 . She has an active role in GDG Eskişehir Community and she is one of the co-organizers at WTM  Eskişehir Community. She has began her career as an Android Developer and she also developes iOS Applications. "},{"id":100,"name":"GDG","title":"","company":"Google Developer Groups","country":"All Over The World","bio":"Google Developer Groups (GDGs) are for developers who are interested in Google's developer technology; everything from the Android, Chrome, Drive, and Google Cloud platforms, to product APIs like the Cast API, Maps API, and YouTube API.<br/><br/>A GDG can take many forms -- from just a few people getting together to watch our latest video, to large gatherings with demos and tech talks, to events like code sprints and hackathons. However, at the core, GDGs are focused on developers and technical content, and the core audience should be developers."}]